## Data Analysis With Python

### Working With Pandas Basics

In [45]:
print("Hello Pandas")

Hello Pandas

In [46]:
import pandas as pd
print("Hello")

Hello

### Series

In [47]:
# series is an one dimentional array 
Data = [1,2,3,4,5]
Series = pd.Series(Data)
print(Series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [48]:
# series from the dictionary
data_dict = {'a':1,'b':2,'c':3,'d':4}
dict_series = pd.Series(data_dict)
print(dict_series)

a    1
b    2
c    3
d    4
dtype: int64

In [49]:
# Trying to Insert an index value as per user choice
data_dict = {'a':1,'100':2,'c':3,'d1d3':4}
dict_series = pd.Series(data_dict)
print(dict_series)

a       1
100     2
c       3
d1d3    4
dtype: int64

In [50]:
# Creating Data and Index Manually 
M_Data = ['one','two','three','four','five']
M_index = range(1,6)         #[1,2,3,4,5]
M_series = pd.Series(M_Data,index=M_index)
print(M_series)

1      one
2      two
3    three
4     four
5     five
dtype: object

### DataFrame

In [51]:
# DataFrame is an multidementional array
data = {
    'name': ['kaushal','rohan','omkar'],
    'age' : [21,34,55],
    'city' : ['mumbai','pune','delhi']
}
Dataframe = pd.DataFrame(data)
print(Dataframe)

# Setting the index manually from the
Dataframe.set_index('age', inplace=True)        
print(Dataframe)

      name  age    city
0  kaushal   21  mumbai
1    rohan   34    pune
2    omkar   55   delhi

In [54]:
# We csn convert this Data frame into the numpy array
import numpy as np 
np.array(Dataframe)

array([['kaushal', 21, 'mumbai'],
       ['rohan', 34, 'pune'],
       ['omkar', 55, 'delhi']], dtype=object)

### Reading CSV File

In [58]:
csv_file = pd.read_csv('customers-100.csv')
csv_file.head(2)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/

In [59]:
csv_file.tail(2)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/